app/views/prescription/show.html.erb

SELECT "medicines".* FROM "medicines" WHERE "medicines"."prescription_id" = ?  [["prescription_id", 1]]
---
        <div class="collection">
          <%@pre.medicines.each do |m|%>